#Область СлужебныйПрограммныйИнтерфейс

// Возвращает ссылку на стандарт.
//
// Параметры:
//  Ошибка  - СправочникСсылка.ОбнаруживаемыеОшибки - Ошибка, описание которой нужно получить.
//
// Возвращаемое значение:
//   Строка   - Ссылка на стандарт.
//
Функция ПолучитьОписаниеОшибки(Ошибка) Экспорт

	ОписаниеОшибки = Новый Структура("СсылкаНаСтандарт, Требование, ОписаниеТребования");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ошибка", Ошибка);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Требования.СсылкаНаСтандарт КАК СсылкаНаСтандарт,
		|	Требования.Требование КАК Требование,
		|	Требования.Требование.Представление КАК ОписаниеТребования
		|ИЗ
		|	Справочник.ОбнаруживаемыеОшибки.Требования КАК Требования
		|ГДЕ
		|	Требования.Ссылка = &Ошибка";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеОшибки, Выборка);
	КонецЕсли; 

	Возврат ОписаниеОшибки;	        	

КонецФункции

#КонецОбласти